import React from "react";
import Collapse from "../collapse";
import { Container, Section, Title } from "../styles/styles";
import { CollapsesWrapper, MoreInfoWrapper } from "./styles";

function MoreInfo() {
  const list = [
    {
      title: "Евакуатор у Дніпрі",
      description: (
        <>
          Наявність власного автомобіля є необхідністю для міських жителів, так
          як це дозволяє більш ефективно організувати маршрут свого щоденного
          пересування. Однак, будучи складним технічним пристроєм, транспортні
          засоби можуть несподівано зламатись, і щоб їх транспортувати на місце
          ремонту або на стоянку, необхідно викликати автоевакуатор.
        </>
      ),
    },
    {
      title: "Коли необхідні професійні послуги евакуаторної техніки",
      description: (
        <>
          Коли необхідні професійні послуги евакуаторної техніки
          <ul>
            <li>Автомобіль потрапив в ДТП і отримав капітальні пошкодження;</li>
            <li>
              Під час поїздки раптово проявилася якась технічна поломка, яка
              привела до знерухомлених машини;
            </li>
            <li>
              Треба вивезти несправний транспорт, який застряг на підземному або
              наземному критому паркінгу;
            </li>
            <li>
              В процесі невдалого маневрування або під час снігопаду або
              ожеледиці автомобіль зісковзнув в кювет;
            </li>
            <li>
              Виявилася блокування коліс автотранспорту, його рульового
              управління, ходової частини або АКПП.
            </li>
          </ul>
          Цілодобовий автоевакуатор в Дніпрі оперативно звільнить проїжджу
          частину, щоб уникнути формування пробки і транспортуватиме його за
          будь-якою адресою в місті. Евакуатор в Дніпрі від evakuator.dp.ua
          надає високоякісну і швидку допомогу легкових транспортних засобів.
        </>
      ),
    },
    {
      title: "Виклик евакуатора",
      description: (
        <>
          Виклик евакуатора в Дніпрі вимагає дотримання деяких правил. Від їх
          виконання залежить функціональність і потужність спецтехніки, яка буде
          відправлена на виклик. Оскільки для реалізації певного комплексу
          профільних операцій спецтехніка повинна мати певні параметри, під час
          оформлення заявки диспетчеру потрібно дати максимально деталізовані
          дані про:
          <ul>
            <li>
              Місцезнаходження несправного автомобіля і наявність можливих
              перешкод на шляху;
            </li>
            <li>Марці, вазі і габаритах автотранспортного засобу;</li>
            <li>
              Стан машини і необхідних операціях (підйом з ями, водойми або
              кювету, постановка на колеса перевернутого авто, буксирування).
            </li>
          </ul>
          Згідно з отриманими даними оператор евакуаторної служби визначає
          маневреність і вантажопідйомність спецтехніки таким чином, щоб за
          найкоротший термін якісно виконати необхідні маніпуляції. Замовити
          евакуатор в Дніпрі можна цілодобово і в будь-який день тижня.
        </>
      ),
    },
  ];

  return (
    <Section golden>
      <Container>
        <MoreInfoWrapper>
          <Title>Додаткова інформація</Title>
          <CollapsesWrapper>
            {list.map(({ title, description }, index) => (
              <Collapse key={index} title={title} description={description} />
            ))}
          </CollapsesWrapper>
        </MoreInfoWrapper>
      </Container>
    </Section>
  );
}

export default MoreInfo;
